In [59]:
import pandas as pd
import numpy as np

In [46]:
df = pd.DataFrame({
    'id': [1, 1, 2, 2, 5],
    'age': [31, 37, 40, 45, 90],
    'school': ['F', 'F', 'M', 'F','F'],
    'name':['ab','cd','ef','gh','ak']
})

In [47]:
df

   id  age school name
0   1   31      F   ab
1   1   37      F   cd
2   2   40      M   ef
3   2   45      F   gh
4   5   90      F   ak

In [48]:
new_df = df.groupby(['id','school']).agg({'age':'max','name':'first'}).reset_index()
new_df

   id school  age name
0   1      F   37   ab
1   2      F   45   gh
2   2      M   40   ef
3   5      F   90   ak

In [56]:
new_df.school.unique()

array(['F', 'M'], dtype=object)

In [49]:
n_df = new_df.groupby(['id']).agg({'age':'max','name':'first','school':'count'}).reset_index()
n_df

   id  age name  school
0   1   37   ab       1
1   2   45   gh       2
2   5   90   ak       1

In [54]:
n_df.age.unique()

array([37, 45, 90], dtype=int64)

In [50]:
vals_to_replace = {2:'multiple', 1:1}
n_df['school'] = n_df['school'].map(vals_to_replace)

In [51]:
n_df

   id  age name    school
0   1   37   ab         1
1   2   45   gh  multiple
2   5   90   ak         1

In [57]:
df_merged = pd.merge(n_df, new_df, on=["id","age","name"], how="left")
df_merged

   id  age name  school_x school_y
0   1   37   ab         1        F
1   2   45   gh  multiple        F
2   5   90   ak         1        F

In [60]:
df_merged['school_x'] = np.where(df_merged['school_x'] == 1, df_merged['school_y'], df_merged['school_x'])
df_merged.head()

   id  age name  school_x school_y
0   1   37   ab         F        F
1   2   45   gh  multiple        F
2   5   90   ak         F        F

In [62]:
del df_merged['school_y']
df_merged.rename(columns={'school_x': 'school'}, inplace=True)
df_merged

   id  age name    school
0   1   37   ab         F
1   2   45   gh  multiple
2   5   90   ak         F